app/controllers/posts_controller.rb

  def create
    @success = false
    @post = Post.new(post_params)
    @image = nil
    if !active_session_user.blank?
      @post.user_id = active_session_user.id
      @post.short_description = create_short_description(@post.description)
      @post.save
      if @post.errors.empty?
        if !params[:post][:tagphoto].blank?
          @image = Image.create(file: params[:post][:tagphoto], imageable_type: 'Post', imageable_id: @post.id)
---
INSERT INTO "posts" ("description", "player_embed", "user_id", "created_at", "updated_at", "like_count") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "This is my package"], ["player_embed", "mysite.com"], ["user_id", 1], ["created_at", "2015-10-18 21:39:11.258557"], ["updated_at", "2015-10-18 21:39:11.258557"], ["like_count", 0]]
INSERT INTO "images" ("file_file_name", "file_content_type", "file_file_size", "file_updated_at", "imageable_type", "imageable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"