app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "ilan.fil@gmail.com"]]
---
  def create
    alerts=''
    x = User.find_by_email(params[:user][:email].downcase)