app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.password = params[:user][:password]
    @success = false
    @image = nil
    @user.save
    if @user.errors.empty?
      if !params[:user][:propic].blank?
        @image = Image.create(file: params[:user][:propic], imageable_type: 'User', imageable_id: @user.id)
---
INSERT INTO "users" ("fname", "lname", "bio", "email", "password_digest", "created_at", "updated_at", "num_posts", "num_endorsements", "full_name", "propic_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "images" ("imageable_type", "imageable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["imageable_type", "User"], ["imageable_id", 1], ["created_at", "2015-10-18 20:27:22.943916"], ["updated_at", "2015-10-18 20:27:22.943916"]]